<template>
    <v-row
        ><v-col
            ><h3>Тестовое задание SquareGPS</h3>
            <TextBlock
                >Необходимо с помощью <b>Vuejs, Vuex, VueRouter, Vuetify</b> написать приложение. Хэдер приложения
                должен содержать меню из 2-х пунктов: <b>О задании</b> и <b>Карта</b>. В основной части приложения
                должно отображаться содержимое разделов.</TextBlock
            >
            <h3>Раздел “О задании”</h3>
            <TextBlock>В разделе должен быть текст этого задания, сверстанный аналогично.</TextBlock>
            <h3>Раздел “Карта”</h3>
            <TextBlock class="mb-0">На экране должны быть карта и список (см пример):</TextBlock>
            <ol>
                <li>
                    При клике на кнопку добавления, карта должна перейти в режим добавления маркера: в месте клика
                    должен появится маркер, а в списке - запись с координатами
                </li>
                <li>При клике на маркер должна подсвечиваться запись в списке</li>
                <li>При клике на запись в списке карта должна центрироваться на маркере</li>
                <li>Маркеры должны храниться локально и не пропадать после перезагрузки страницы</li>
                <li>В адресной строке должен отображаться id выбранного маркера</li>
            </ol>
            <br />
            <TextBlock>
                Локальное хранение данных должно быть организовано в виде сервиса, эмулирующего бекенд.
            </TextBlock>
            <h4>Дополнительно:</h4>
            <ol>
                <li>Продумать отображение на мобильных устройствах</li>
                <li>Предусмотреть локализацию</li>
                <li>Необходимо с помощью <b>jest</b> написть 1 модульный тест на любой компонент</li>
            </ol>
            <br />
            <TextBlock>
                <b>Напоминание:</b> тестовое задание призвано показать умение писать хороший модульный код, а также
                умение пользоваться указанными технологиями и не только. Этим кодом нужно гордиться.
            </TextBlock>
            <TextBlock>Пример:</TextBlock>
            <v-row align="center" justify="center"
                ><v-col md="6" cols="12" class="sample-image"
                    ><img :src="require('@/assets/image/sample-design.png')" alt="" /></v-col
            ></v-row> </v-col
    ></v-row>
</template>

<script lang="ts">
import Vue from 'vue';
import TextBlock from '@/components/common/typography/TextBlock/TextBlock.vue';

export default Vue.extend({
    name: 'About',
    components: {
        TextBlock
    }
});
</script>

<style scoped lang="scss">
@import './style.scss';
</style>
